Output from `terraform plan`
```
                    }
                  - "Update Hive Tables"                                   = {
                      - Next       = "Prepare Temp Reload Bucket Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"       = "finance"
                              - "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          - JobName   = "dpr-hive-table-creation-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                }
            }
        ) -> null
      - id                        = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-reload-pipeline-nomis-finance-preproduction" -> null
      - name                      = "dpr-reload-pipeline-nomis-finance-preproduction" -> null
      - publish                   = false -> null
      - revision_id               = "b8372b1a-bcbd-4986-a8e0-296ad9336e8d" -> null
      - role_arn                  = "arn:aws:iam::972272129531:role/dpr-step-function-execution-role" -> null
      - status                    = "ACTIVE" -> null
      - tags                      = {
          - "Domain"         = "finance"
          - "Jira"           = "main"
          - "Resource_Type"  = "Step Function"
          - "Service_Bundle" = "true"
        } -> null
      - tags_all                  = {
          - "Domain"         = "finance"
          - "Jira"           = "main"
          - "Resource_Type"  = "Step Function"
          - "Service_Bundle" = "true"
        } -> null
      - type                      = "STANDARD" -> null
        # (3 unchanged attributes hidden)

      - encryption_configuration {
          - kms_data_key_reuse_period_seconds = 0 -> null
          - type                              = "AWS_OWNED_KEY" -> null
            # (1 unchanged attribute hidden)
        }

      - logging_configuration {
          - include_execution_data = false -> null
          - level                  = "OFF" -> null
            # (1 unchanged attribute hidden)
        }

      - tracing_configuration {
          - enabled = false -> null
        }
    }

  # module.reload-pipeline["finance-txs"].module.reload_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-reload-pipeline-nomis-finance-txs-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = "arn:aws:iam::972272129531:role/dpr-step-function-execution-role"
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "finance-txs"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "finance-txs"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)

      + encryption_configuration (known after apply)

      + logging_configuration (known after apply)

      + tracing_configuration (known after apply)
    }

  # module.reload-pipeline["program-profiles"].module.reload_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-reload-pipeline-nomis-program-profiles-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = "arn:aws:iam::972272129531:role/dpr-step-function-execution-role"
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "program-profiles"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "program-profiles"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)

      + encryption_configuration (known after apply)

      + logging_configuration (known after apply)

      + tracing_configuration (known after apply)
    }

  # module.replay-pipeline["activities"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be destroyed
  # (because module.replay-pipeline["activities"].module.replay_pipeline is not in configuration)
  - resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      - arn                       = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-replay-pipeline-nomis-activities-preproduction" -> null
      - creation_date             = "2024-02-13T16:32:44Z" -> null
      - definition                = jsonencode(
            {
              - Comment = "Replay Pipeline Step Function"
              - StartAt = "Deactivate Archive Trigger"
              - States  = {
                  - "Archive Remaining Raw Files"                          = {
                      - Next       = "Copy Archived Data to Raw Bucket"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                        = "activities"
                              - "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              - "--dpr.datastorage.retry.maxAttempts"     = "10"
                              - "--dpr.datastorage.retry.maxWaitMillis"   = "10000"
                              - "--dpr.datastorage.retry.minWaitMillis"   = "1000"
                              - "--dpr.file.transfer.delete.copied.files" = "true"
                              - "--dpr.file.transfer.destination.bucket"  = "dpr-raw-archive-preproduction"
                              - "--dpr.file.transfer.source.bucket"       = "dpr-raw-zone-preproduction"
                            }
                          - JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Check All Files Have Been Replayed"                   = {
                      - Next       = "Empty Raw Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.allowed.s3.file.regex"               = "\\d+-\\d+.parquet"
                              - "--dpr.orchestration.max.attempts"          = "8"
                              - "--dpr.orchestration.wait.interval.seconds" = "900"
                            }
                          - JobName   = "pending-files-check-activities-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Check All Pending Files Have Been Processed"          = {
                      - Next       = "Stop Glue Streaming Job"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.orchestration.max.attempts"          = "8"
                              - "--dpr.orchestration.wait.interval.seconds" = "900"
                            }
                          - JobName   = "pending-files-check-activities-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Copy Archived Data to Raw Bucket"                     = {
                      - Next       = "Start Glue Batch Job"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                            = "activities"
                              - "--dpr.config.s3.bucket"                      = "dpr-glue-jobs-preproduction"
                              - "--dpr.datastorage.retry.maxAttempts"         = "10"
                              - "--dpr.datastorage.retry.maxWaitMillis"       = "10000"
                              - "--dpr.datastorage.retry.minWaitMillis"       = "1000"
                              - "--dpr.file.transfer.delete.copied.files"     = "false"
                              - "--dpr.file.transfer.destination.bucket"      = "dpr-raw-zone-preproduction"
                              - "--dpr.file.transfer.retention.period.amount" = "0"
                              - "--dpr.file.transfer.source.bucket"           = "dpr-raw-archive-preproduction"
                            }
                          - JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Copy Curated Data to Temp-Reload Bucket"              = {
                      - Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                        = "activities"
                              - "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              - "--dpr.datastorage.retry.maxAttempts"     = "10"
                              - "--dpr.datastorage.retry.maxWaitMillis"   = "10000"
                              - "--dpr.datastorage.retry.minWaitMillis"   = "1000"
                              - "--dpr.file.transfer.delete.copied.files" = "false"
                              - "--dpr.file.transfer.destination.bucket"  = "dpr-temp-reload-preproduction"
                              - "--dpr.file.transfer.source.bucket"       = "dpr-curated-zone-preproduction"
                            }
                          - JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Deactivate Archive Trigger"                           = {
                      - Next       = "Stop Archive Job"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.glue.trigger.activate" = "false"
                              - "--dpr.glue.trigger.name"     = "dpr-archive-activities-preproduction-trigger"
                            }
                          - JobName   = "dpr-activate-glue-trigger-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Empty Raw Data"                                       = {
                      - Next       = "Resume DMS Replication Task"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "activities"
                              - "--dpr.file.deletion.buckets" = "dpr-raw-zone-preproduction"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Empty Structured and Curated Data"                    = {
                      - Next       = "Archive Remaining Raw Files"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "activities"
                              - "--dpr.file.deletion.buckets" = "dpr-structured-zone-preproduction,dpr-curated-zone-preproduction"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Empty Temp Reload Bucket Data"                        = {
                      - End        = true
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "activities"
                              - "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Prepare Temp Reload Bucket Data"                      = {
                      - Next       = "Copy Curated Data to Temp-Reload Bucket"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "activities"
                              - "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Reactivate Archive Trigger"                           = {
                      - Next       = "Empty Temp Reload Bucket Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.glue.trigger.activate" = "true"
                              - "--dpr.glue.trigger.name"     = "dpr-archive-activities-preproduction-trigger"
                            }
                          - JobName   = "dpr-activate-glue-trigger-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Resume DMS Replication Task"                          = {
                      - Next       = "Switch Hive Tables for Prisons to Curated"
                      - Parameters = {
                          - ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:SMLKOL5DWNBDHFC6BCYLLDGKQM"
                          - StartReplicationTaskType = "resume-processing"
                        }
                      - Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      - Type       = "Task"
                    }
                  - "Run Compaction Job on Curated Zone"                   = {
                      - Next       = "Run Vacuum Job on Curated Zone"
                      - Parameters = {
                          - Arguments       = {
                              - "--dpr.config.key"            = "activities"
                              - "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              - "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-preproduction/nomis/"
                            }
                          - JobName         = "dpr-maintenance-compaction-preproduction"
                          - NumberOfWorkers = 10
                          - WorkerType      = "G.1X"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Run Compaction Job on Structured Zone"                = {
                      - Next       = "Run Vacuum Job on Structured Zone"
                      - Parameters = {
                          - Arguments       = {
                              - "--dpr.config.key"            = "activities"
                              - "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              - "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-preproduction/nomis/"
                            }
                          - JobName         = "dpr-maintenance-compaction-preproduction"
                          - NumberOfWorkers = 10
                          - WorkerType      = "G.1X"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Run Vacuum Job on Curated Zone"                       = {
                      - Next       = "Start Glue Streaming Job"
                      - Parameters = {
                          - Arguments       = {
                              - "--dpr.config.key"            = "activities"
                              - "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              - "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-preproduction/nomis/"
                            }
                          - JobName         = "dpr-maintenance-retention-preproduction"
                          - NumberOfWorkers = 2
                          - WorkerType      = "G.1X"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Run Vacuum Job on Structured Zone"                    = {
                      - Next       = "Run Compaction Job on Curated Zone"
                      - Parameters = {
                          - Arguments       = {
                              - "--dpr.config.key"            = "activities"
                              - "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              - "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-preproduction/nomis/"
                            }
                          - JobName         = "dpr-maintenance-retention-preproduction"
                          - NumberOfWorkers = 2
                          - WorkerType      = "G.1X"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Start Glue Batch Job"                                 = {
                      - Next       = "Run Compaction Job on Structured Zone"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.batch.load.fileglobpattern" = "{part-*.snappy.parquet,LOAD*parquet}"
                              - "--dpr.config.key"                 = "activities"
                              - "--dpr.config.s3.bucket"           = "dpr-glue-jobs-preproduction"
                            }
                          - JobName   = "dpr-batch-activities-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Start Glue Streaming Job"                             = {
                      - Next       = "Check All Files Have Been Replayed"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.clean.cdc.checkpoint" = "true"
                              - "--dpr.config.key"           = "activities"
                              - "--dpr.config.s3.bucket"     = "dpr-glue-jobs-preproduction"
                            }
                          - JobName   = "dpr-cdc-activities-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun"
                      - Type       = "Task"
                    }
                  - "Stop Archive Job"                                     = {
                      - Next       = "Stop DMS Replication Task"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.stop.glue.instance.job.name" = "dpr-archive-activities-preproduction"
                            }
                          - JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Stop DMS Replication Task"                            = {
                      - Next       = "Check All Pending Files Have Been Processed"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.dms.replication.task.id" = "dpr-dms-nomis-oracle-s3-activities-task-preproduction"
                            }
                          - JobName   = "dpr-stop-dms-task-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Stop Glue Streaming Job"                              = {
                      - Next       = "Prepare Temp Reload Bucket Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.stop.glue.instance.job.name" = "dpr-cdc-activities-preproduction"
                            }
                          - JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Switch Hive Tables for Prisons to Curated"            = {
                      - Next       = "Reactivate Archive Trigger"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                         = "activities"
                              - "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-preproduction"
                            }
                          - JobName   = "dpr-switch-prisons-data-source-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      - Next       = "Empty Structured and Curated Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                         = "activities"
                              - "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-preproduction"
                            }
                          - JobName   = "dpr-switch-prisons-data-source-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                }
            }
        ) -> null
      - id                        = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-replay-pipeline-nomis-activities-preproduction" -> null
      - name                      = "dpr-replay-pipeline-nomis-activities-preproduction" -> null
      - publish                   = false -> null
      - revision_id               = "afa33555-92ee-4c14-92d8-f7aa42e838a4" -> null
      - role_arn                  = "arn:aws:iam::972272129531:role/dpr-step-function-execution-role" -> null
      - status                    = "ACTIVE" -> null
      - tags                      = {
          - "Domain"         = "activities"
          - "Jira"           = "main"
          - "Resource_Type"  = "Step Function"
          - "Service_Bundle" = "true"
        } -> null
      - tags_all                  = {
          - "Domain"         = "activities"
          - "Jira"           = "main"
          - "Resource_Type"  = "Step Function"
          - "Service_Bundle" = "true"
        } -> null
      - type                      = "STANDARD" -> null
        # (3 unchanged attributes hidden)

      - encryption_configuration {
          - kms_data_key_reuse_period_seconds = 0 -> null
          - type                              = "AWS_OWNED_KEY" -> null
            # (1 unchanged attribute hidden)
        }

      - logging_configuration {
          - include_execution_data = false -> null
          - level                  = "OFF" -> null
            # (1 unchanged attribute hidden)
        }

      - tracing_configuration {
          - enabled = false -> null
        }
    }

  # module.replay-pipeline["adjustment-txns"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-replay-pipeline-nomis-adjustment-txns-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = "arn:aws:iam::972272129531:role/dpr-step-function-execution-role"
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "adjustment-txns"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "adjustment-txns"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)

      + encryption_configuration (known after apply)

      + logging_configuration (known after apply)

      + tracing_configuration (known after apply)
    }

  # module.replay-pipeline["course-attendance"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-replay-pipeline-nomis-course-attendance-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = "arn:aws:iam::972272129531:role/dpr-step-function-execution-role"
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "course-attendance"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "course-attendance"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)

      + encryption_configuration (known after apply)

      + logging_configuration (known after apply)

      + tracing_configuration (known after apply)
    }

  # module.replay-pipeline["finance"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be destroyed
  # (because module.replay-pipeline["finance"].module.replay_pipeline is not in configuration)
  - resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      - arn                       = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-replay-pipeline-nomis-finance-preproduction" -> null
      - creation_date             = "2024-08-06T16:41:40Z" -> null
      - definition                = jsonencode(
            {
              - Comment = "Replay Pipeline Step Function"
              - StartAt = "Deactivate Archive Trigger"
              - States  = {
                  - "Archive Remaining Raw Files"                          = {
                      - Next       = "Copy Archived Data to Raw Bucket"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                        = "finance"
                              - "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              - "--dpr.datastorage.retry.maxAttempts"     = "10"
                              - "--dpr.datastorage.retry.maxWaitMillis"   = "10000"
                              - "--dpr.datastorage.retry.minWaitMillis"   = "1000"
                              - "--dpr.file.transfer.delete.copied.files" = "true"
                              - "--dpr.file.transfer.destination.bucket"  = "dpr-raw-archive-preproduction"
                              - "--dpr.file.transfer.source.bucket"       = "dpr-raw-zone-preproduction"
                            }
                          - JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Check All Files Have Been Replayed"                   = {
                      - Next       = "Empty Raw Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.allowed.s3.file.regex"               = "\\d+-\\d+.parquet"
                              - "--dpr.orchestration.max.attempts"          = "8"
                              - "--dpr.orchestration.wait.interval.seconds" = "900"
                            }
                          - JobName   = "pending-files-check-finance-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Check All Pending Files Have Been Processed"          = {
                      - Next       = "Stop Glue Streaming Job"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.orchestration.max.attempts"          = "8"
                              - "--dpr.orchestration.wait.interval.seconds" = "900"
                            }
                          - JobName   = "pending-files-check-finance-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Copy Archived Data to Raw Bucket"                     = {
                      - Next       = "Start Glue Batch Job"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                            = "finance"
                              - "--dpr.config.s3.bucket"                      = "dpr-glue-jobs-preproduction"
                              - "--dpr.datastorage.retry.maxAttempts"         = "10"
                              - "--dpr.datastorage.retry.maxWaitMillis"       = "10000"
                              - "--dpr.datastorage.retry.minWaitMillis"       = "1000"
                              - "--dpr.file.transfer.delete.copied.files"     = "false"
                              - "--dpr.file.transfer.destination.bucket"      = "dpr-raw-zone-preproduction"
                              - "--dpr.file.transfer.retention.period.amount" = "0"
                              - "--dpr.file.transfer.source.bucket"           = "dpr-raw-archive-preproduction"
                            }
                          - JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Copy Curated Data to Temp-Reload Bucket"              = {
                      - Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                        = "finance"
                              - "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              - "--dpr.datastorage.retry.maxAttempts"     = "10"
                              - "--dpr.datastorage.retry.maxWaitMillis"   = "10000"
                              - "--dpr.datastorage.retry.minWaitMillis"   = "1000"
                              - "--dpr.file.transfer.delete.copied.files" = "false"
                              - "--dpr.file.transfer.destination.bucket"  = "dpr-temp-reload-preproduction"
                              - "--dpr.file.transfer.source.bucket"       = "dpr-curated-zone-preproduction"
                            }
                          - JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Deactivate Archive Trigger"                           = {
                      - Next       = "Stop Archive Job"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.glue.trigger.activate" = "false"
                              - "--dpr.glue.trigger.name"     = "dpr-archive-finance-preproduction-trigger"
                            }
                          - JobName   = "dpr-activate-glue-trigger-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Empty Raw Data"                                       = {
                      - Next       = "Resume DMS Replication Task"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "finance"
                              - "--dpr.file.deletion.buckets" = "dpr-raw-zone-preproduction"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Empty Structured and Curated Data"                    = {
                      - Next       = "Archive Remaining Raw Files"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "finance"
                              - "--dpr.file.deletion.buckets" = "dpr-structured-zone-preproduction,dpr-curated-zone-preproduction"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Empty Temp Reload Bucket Data"                        = {
                      - End        = true
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "finance"
                              - "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Prepare Temp Reload Bucket Data"                      = {
                      - Next       = "Copy Curated Data to Temp-Reload Bucket"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "finance"
                              - "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Reactivate Archive Trigger"                           = {
                      - Next       = "Empty Temp Reload Bucket Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.glue.trigger.activate" = "true"
                              - "--dpr.glue.trigger.name"     = "dpr-archive-finance-preproduction-trigger"
                            }
                          - JobName   = "dpr-activate-glue-trigger-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Resume DMS Replication Task"                          = {
                      - Next       = "Switch Hive Tables for Prisons to Curated"
                      - Parameters = {
                          - ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:3BX4K5VVXFH75LYEXESIQSHSHM"
                          - StartReplicationTaskType = "resume-processing"
                        }
                      - Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      - Type       = "Task"
                    }
                  - "Run Compaction Job on Curated Zone"                   = {
                      - Next       = "Run Vacuum Job on Curated Zone"
                      - Parameters = {
                          - Arguments       = {
                              - "--dpr.config.key"            = "finance"
                              - "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              - "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-preproduction/nomis/"
                            }
                          - JobName         = "dpr-maintenance-compaction-preproduction"
                          - NumberOfWorkers = 10
                          - WorkerType      = "G.1X"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Run Compaction Job on Structured Zone"                = {
                      - Next       = "Run Vacuum Job on Structured Zone"
                      - Parameters = {
                          - Arguments       = {
                              - "--dpr.config.key"            = "finance"
                              - "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              - "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-preproduction/nomis/"
                            }
                          - JobName         = "dpr-maintenance-compaction-preproduction"
                          - NumberOfWorkers = 10
                          - WorkerType      = "G.1X"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Run Vacuum Job on Curated Zone"                       = {
                      - Next       = "Start Glue Streaming Job"
                      - Parameters = {
                          - Arguments       = {
                              - "--dpr.config.key"            = "finance"
                              - "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              - "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-preproduction/nomis/"
                            }
                          - JobName         = "dpr-maintenance-retention-preproduction"
                          - NumberOfWorkers = 2
                          - WorkerType      = "G.1X"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Run Vacuum Job on Structured Zone"                    = {
                      - Next       = "Run Compaction Job on Curated Zone"
                      - Parameters = {
                          - Arguments       = {
                              - "--dpr.config.key"            = "finance"
                              - "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              - "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-preproduction/nomis/"
                            }
                          - JobName         = "dpr-maintenance-retention-preproduction"
                          - NumberOfWorkers = 2
                          - WorkerType      = "G.1X"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Start Glue Batch Job"                                 = {
                      - Next       = "Run Compaction Job on Structured Zone"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.batch.load.fileglobpattern" = "{part-*.snappy.parquet,LOAD*parquet}"
                              - "--dpr.config.key"                 = "finance"
                              - "--dpr.config.s3.bucket"           = "dpr-glue-jobs-preproduction"
                            }
                          - JobName   = "dpr-batch-finance-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Start Glue Streaming Job"                             = {
                      - Next       = "Check All Files Have Been Replayed"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.clean.cdc.checkpoint" = "true"
                              - "--dpr.config.key"           = "finance"
                              - "--dpr.config.s3.bucket"     = "dpr-glue-jobs-preproduction"
                            }
                          - JobName   = "dpr-cdc-finance-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun"
                      - Type       = "Task"
                    }
                  - "Stop Archive Job"                                     = {
                      - Next       = "Stop DMS Replication Task"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.stop.glue.instance.job.name" = "dpr-archive-finance-preproduction"
                            }
                          - JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Stop DMS Replication Task"                            = {
                      - Next       = "Check All Pending Files Have Been Processed"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.dms.replication.task.id" = "dpr-dms-nomis-oracle-s3-finance-task-preproduction"
                            }
                          - JobName   = "dpr-stop-dms-task-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Stop Glue Streaming Job"                              = {
                      - Next       = "Prepare Temp Reload Bucket Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.stop.glue.instance.job.name" = "dpr-cdc-finance-preproduction"
                            }
                          - JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Switch Hive Tables for Prisons to Curated"            = {
                      - Next       = "Reactivate Archive Trigger"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                         = "finance"
                              - "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-preproduction"
                            }
                          - JobName   = "dpr-switch-prisons-data-source-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      - Next       = "Empty Structured and Curated Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                         = "finance"
                              - "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-preproduction"
                            }
                          - JobName   = "dpr-switch-prisons-data-source-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                }
            }
        ) -> null
      - id                        = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-replay-pipeline-nomis-finance-preproduction" -> null
      - name                      = "dpr-replay-pipeline-nomis-finance-preproduction" -> null
      - publish                   = false -> null
      - revision_id               = "0e908d07-22b6-4a78-b26e-06d3f75c24a4" -> null
      - role_arn                  = "arn:aws:iam::972272129531:role/dpr-step-function-execution-role" -> null
      - status                    = "ACTIVE" -> null
      - tags                      = {
          - "Domain"         = "finance"
          - "Jira"           = "main"
          - "Resource_Type"  = "Step Function"
          - "Service_Bundle" = "true"
        } -> null
      - tags_all                  = {
          - "Domain"         = "finance"
          - "Jira"           = "main"
          - "Resource_Type"  = "Step Function"
          - "Service_Bundle" = "true"
        } -> null
      - type                      = "STANDARD" -> null
        # (3 unchanged attributes hidden)

      - encryption_configuration {
          - kms_data_key_reuse_period_seconds = 0 -> null
          - type                              = "AWS_OWNED_KEY" -> null
            # (1 unchanged attribute hidden)
        }

      - logging_configuration {
          - include_execution_data = false -> null
          - level                  = "OFF" -> null
            # (1 unchanged attribute hidden)
        }

      - tracing_configuration {
          - enabled = false -> null
        }
    }

  # module.replay-pipeline["finance-txs"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-replay-pipeline-nomis-finance-txs-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = "arn:aws:iam::972272129531:role/dpr-step-function-execution-role"
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "finance-txs"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "finance-txs"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)

      + encryption_configuration (known after apply)

      + logging_configuration (known after apply)

      + tracing_configuration (known after apply)
    }

  # module.replay-pipeline["program-profiles"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-replay-pipeline-nomis-program-profiles-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = "arn:aws:iam::972272129531:role/dpr-step-function-execution-role"
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "program-profiles"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "program-profiles"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)

      + encryption_configuration (known after apply)

      + logging_configuration (known after apply)

      + tracing_configuration (known after apply)
    }

  # module.setup-dms-endpoints["dps-activities"].module.dms_endpoints.aws_dms_endpoint.dms-s3-target-source[0] will be updated in-place
  ~ resource "aws_dms_endpoint" "dms-s3-target-source" {
        id                              = "dpr-dms-dps-activities-pgres-source-endpoint"
        tags                            = {
            "DMS_Source"     = "dps"
            "Domain"         = "Common"
            "Jira"           = "main"
            "Resource_Type"  = "DMS Source Endpoint"
            "Service_Bundle" = "true"
        }
        # (16 unchanged attributes hidden)

      ~ postgres_settings {
          ~ fail_tasks_on_lob_truncation = false -> true
          ~ heartbeat_frequency          = 0 -> 5
            # (14 unchanged attributes hidden)
        }
    }

Plan: 298 to add, 204 to change, 150 to destroy.

```